starjunes/GD32/source/hal/driver/c/st_uart_drv.c
        DMA_Init((DMA_Channel_TypeDef *)pinfo->dma_base_tx, &dma_initstruct);
        ST_IRQ_ConfigIrqEnable(irq_id, false);                                  /* 关闭中断 */
        ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                           /* install irq handle */
        ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_TXDMA);
        ST_IRQ_ConfigIrqEnable(irq_id, true);                                   /* 打开中断 */
        
    }
    
    /* 配置接收通道 */
    if (pinfo->dma_base_rx != 0) {
        switch (pinfo->dma_base_rx)
	    {
        case DMA1_Channel3_BASE:                          /* for uart1 rx */
            irq_id   = DMA1_Channel3_IRQn;
            irqhandler = (IRQ_SERVICE_FUNC)DMA1_CHANNEL3_IrqHandle;
            is_dma1  = TRUE;
            break;
        case DMA1_Channel5_BASE:                          /* for uart2 rx */
            irq_id   = DMA1_Channel5_IRQn;
            irqhandler = (IRQ_SERVICE_FUNC)DMA1_CHANNEL5_IrqHandle;
            is_dma1  = TRUE;
	  	    break;
        case DMA1_Channel6_BASE:                          /* for uart3 rx */
            irq_id   = DMA1_Channel6_IRQn;
            irqhandler = (IRQ_SERVICE_FUNC)DMA1_CHANNEL6_IrqHandle;
            is_dma1  = TRUE;
	  	    break;
        default:
            return;
        }
    
        /* dma clock enable */
        if (is_dma1) {
            RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
        } else {
            RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, ENABLE);
        }
    
        DMA_DeInit((DMA_Channel_TypeDef *)pinfo->dma_base_rx);             /* 恢复DMA通道 */
    
        DMA_StructInit(&dma_initstruct);
        dma_initstruct.DMA_PeripheralBaseAddr  = (INT32U)&(((USART_TypeDef *)pinfo->uart_base)->DR);/* 外设基准地址 */
        dma_initstruct.DMA_MemoryBaseAddr      = (INT32U)s_uart[pinfo->com].p_dma_rx0;     /* 内存基准地址 */
        dma_initstruct.DMA_DIR                 = DMA_DIR_PeripheralSRC;        /* 通道方向 */
        dma_initstruct.DMA_BufferSize          = DMA_RX_LEN;                   /* 内存缓存大小 */
        dma_initstruct.DMA_PeripheralInc       = DMA_PeripheralInc_Disable;    /* 外设地址不自增 */
        dma_initstruct.DMA_MemoryInc           = DMA_MemoryInc_Enable;         /* 内存地址自增 */
        dma_initstruct.DMA_PeripheralDataSize  = DMA_PeripheralDataSize_Byte;  /* 字节模式 */
        dma_initstruct.DMA_MemoryDataSize      = DMA_MemoryDataSize_Byte;      /* 字节模式 */
        dma_initstruct.DMA_Mode                = DMA_Mode_Normal;              /* 正常模式 */
        dma_initstruct.DMA_Priority            = DMA_Priority_Low;                 
        dma_initstruct.DMA_M2M                 = DMA_M2M_Disable;
        s_uart[pinfo->com].sel = 0;
    
        DMA_Init((DMA_Channel_TypeDef *)pinfo->dma_base_rx, &dma_initstruct);
    
        ST_IRQ_ConfigIrqEnable(irq_id, false);                                  /* 关闭中断 */
        ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                           /* install irq handle */
        ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_RXDMA);
        ST_IRQ_ConfigIrqEnable(irq_id, true);                                   /* 打开中断 */
    }
}

/*******************************************************************
** 函数名称: STM32_UART_TxDMAStart
** 函数描述: 启动串口DMA发送功能
** 参数:     [in] uart_id: 串口通道编号
**           [in] memaddr: DMA内存地址
**           [in] memlen:  发送数据长度
** 返回:     无
********************************************************************/
__attribute__ ((section ("IRQ_HANDLE"))) static void STM32_UART_TxDMAStart(INT8U com, INT8U *memaddr, INT16U memlen)
{
    const UART_TBL_T *pinfo;
    DMA_Channel_TypeDef  *dma_channel;
    
    pinfo = ST_UART_GetRegTblInfo(com);
    dma_channel = (DMA_Channel_TypeDef *)pinfo->dma_base_tx;
    
    DMA_Cmd(dma_channel, DISABLE);                                             /* disable DMA channelx transfer */
    DMA_ITConfig(dma_channel, DMA_IT_TC, DISABLE);                             /* disable DMA channelx transfer complete interrupt */
    
    dma_channel->CMAR  = (INT32U)memaddr;
    dma_channel->CNDTR = memlen;
    
    DMA_ITConfig(dma_channel, DMA_IT_TC, ENABLE);                              /* enable DMA channelx transfer complete interrupt */
    DMA_Cmd(dma_channel, ENABLE);                                              /* enable DMA channelx transfer */
}

/*******************************************************************
** 函数名称: STM32_UART_IrqConfig
** 函数描述: 配置串口中断功能
** 参数:     [in] pinfo  : 配置参数
**           [in] inter  : 中断配置
** 返回:     无
********************************************************************/
static void STM32_UART_IrqConfig(const UART_TBL_T *pinfo)
{
    INT32S irq_id;
    IRQ_SERVICE_FUNC irqhandler;
    
    if (pinfo == 0) {
        return;
    }
    
    switch (pinfo->uart_base)
    {
    case USART1_BASE:
        irq_id = USART1_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)UART1_IrqHandle;
	  	break;
    case USART2_BASE:
        irq_id = USART2_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)UART2_IrqHandle;
        break;
    case USART3_BASE:
        irq_id = USART3_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)UART3_IrqHandle;
        break;
    default:
        return;
    }
    
    ST_IRQ_ConfigIrqEnable(irq_id, false);                                      /* 关闭中断 */
    ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                               /* install irq handle */
    ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_UART);
    ST_IRQ_ConfigIrqEnable(irq_id, true);                                       /* 打开中断 */
    //USART_ITConfig((USART_TypeDef *)pinfo->uart_base, inter, ENABLE); /* enable the usart rx or tx interrupt */
}

/*******************************************************************
** 函数名称: STM32_UART_Init
** 函数描述: 串口通信参数配置，并设置是否支持DMA
** 参数:     [in]  cfg:串口配置参数 
** 返回:     无
********************************************************************/
BOOLEAN printf_com(const char *fmt, ...);
static void STM32_UART_Init(UART_CFG_T *cfg)
{
    INT8U com;
    INT16U stopbit, databit, parity, mode;
    INT32U baud;
    USART_InitTypeDef usart_initstruct;
    USART_ClockInitTypeDef usart_clock;
    const UART_TBL_T *pinfo;
	  
    com = cfg->com;
    pinfo = ST_UART_GetRegTblInfo(com);

    
	usart_clock.USART_Clock               = USART_Clock_Disable;
    usart_clock.USART_CPOL                = USART_CPOL_Low;
    usart_clock.USART_CPHA                = USART_CPHA_2Edge;
    usart_clock.USART_LastBit             = USART_LastBit_Disable;    

    
    baud = cfg->baud;
    switch (cfg->databit)
    {
	case UART_DATABIT_8:
	    databit = USART_WordLength_8b;
	    break;
	case UART_DATABIT_9:
	    databit = USART_WordLength_9b;
	    break;
	default:
	    databit = USART_WordLength_8b;
	    break;
	}
	     
    switch (cfg->stopbit)
    {
    case UART_STOPBIT_1:
        stopbit = USART_StopBits_1;
	    break;
	case UART_STOPBIT_1_5:
	    stopbit = USART_StopBits_1_5;
	    break;
	case UART_STOPBIT_2:
	    stopbit = USART_StopBits_2;
	    break;
	case UART_STOPBIT_0_5:
	    //stopbit = USART_StopBits_0_5;
        stopbit = USART_StopBits_1;
	    break;
	default:
	    stopbit = USART_StopBits_1;
	    break;
	}
	
	switch (cfg->parity)
	{
	case UART_PARITY_NONE:
	    parity = USART_Parity_No;
	    break;
	case UART_PARITY_EVEN:
	    parity = USART_Parity_Even;
	    break;
	case UART_PARITY_ODD:
	    parity = USART_Parity_Odd;
	    break;
	default:
	    parity = USART_Parity_No;
	    break;
	}
	mode = USART_Mode_Rx | USART_Mode_Tx;
	
	/* deinit usart */
	//USART_Cmd((USART_TypeDef *)pinfo->uart_base, DISABLE);
	USART_DeInit((USART_TypeDef *)pinfo->uart_base);
	
	usart_initstruct.USART_BaudRate            = baud;
    //usart_initstruct.USART_BaudRate            = 9600L;
	usart_initstruct.USART_WordLength          = databit;
	usart_initstruct.USART_StopBits            = stopbit;
	usart_initstruct.USART_Parity              = parity;
	usart_initstruct.USART_Mode                = mode;
	usart_initstruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
     /* usart clock enable */
     RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE); /* 开启gpio复用时钟 */
    if (pinfo->uart_base == USART1_BASE) {
        RCC_APB2PeriphClockCmd(pinfo->uart_rcc, ENABLE);
    } else {
        RCC_APB1PeriphClockCmd(pinfo->uart_rcc, ENABLE);
    }

	/* configure usart */
	USART_Init((USART_TypeDef *)pinfo->uart_base, &usart_initstruct);
    USART_ClockInit((USART_TypeDef *)pinfo->uart_base, &usart_clock);

	if (pinfo->dma_base_tx != 0 && pinfo->dma_base_rx != 0) {
	    /* enable usart dma tx and rx request */
	    USART_DMACmd((USART_TypeDef *)pinfo->uart_base, USART_DMAReq_Tx | USART_DMAReq_Rx, ENABLE);
	    STM32_UART_IrqConfig(pinfo);
	    USART_ITConfig((USART_TypeDef *)pinfo->uart_base, USART_IT_IDLE, ENABLE);
    } else if (pinfo->dma_base_tx != 0) {
        /* enable usart dma tx request */
        USART_DMACmd((USART_TypeDef *)pinfo->uart_base, USART_DMAReq_Tx, ENABLE);
        STM32_UART_IrqConfig(pinfo);
        USART_ITConfig((USART_TypeDef *)pinfo->uart_base, USART_IT_RXNE, ENABLE);
        //USART_ITConfig((USART_TypeDef *)pinfo->uart_base, USART_IT_ERR, ENABLE);
    } else if (pinfo->dma_base_rx != 0) {
        /* enable usart dma rx request */
        USART_DMACmd((USART_TypeDef *)pinfo->uart_base, USART_DMAReq_Rx, ENABLE);
        STM32_UART_IrqConfig(pinfo);
        USART_ITConfig((USART_TypeDef *)pinfo->uart_base, USART_IT_TXE, ENABLE);
        USART_ITConfig((USART_TypeDef *)pinfo->uart_base, USART_IT_IDLE, ENABLE);
    } else {
	    /* config usart rx or tx interrupt and enable it*/
        STM32_UART_IrqConfig(pinfo);
        USART_ITConfig((USART_TypeDef *)pinfo->uart_base, USART_IT_RXNE, ENABLE);
        USART_ITConfig((USART_TypeDef *)pinfo->uart_base, USART_IT_TXE, ENABLE);
	}

    /* enable the usart */
    USART_Cmd((USART_TypeDef *)pinfo->uart_base, ENABLE);
}

/*******************************************************************
** 函数名称: ST_UART_InitDrv
** 函数描述: 初始化串口驱动
** 参数:     无
** 返回:     无
********************************************************************/
void ST_UART_InitDrv(void)
{
    UART_CFG_T cfg;
    
    YX_MEMSET(&s_uart, 0, sizeof(s_uart));
    
