starjunes/GD32/source/hal/driver/c/st_uart_drv.c
    cfg.com     = UART_COM_0;
    cfg.baud    = 115200;
    cfg.parity  = UART_PARITY_NONE;
    cfg.databit = UART_DATABIT_8;
    cfg.stopbit = UART_STOPBIT_1;
    
    cfg.rx_fcm  = UART_FCM_NULL;     /* 接收流控模式,见UART_FCM_E */
    cfg.tx_fcm  = UART_FCM_NULL;     /* 发送流控模式,见UART_FCM_E */
    
    cfg.rx_len  = 256;               /* 配置平台接收缓存长度 */
    cfg.tx_len  = 512;               /* 配置平台发送缓存长度 */
    
    //ST_UART_OpenUart(&cfg);
    
    cfg.com     = UART_COM_1;
    cfg.baud    = 9600;
    cfg.rx_len  = 128;               /* 配置平台接收缓存长度 */
    cfg.tx_len  = 512;               /* 配置平台发送缓存长度 */
    ST_UART_OpenUart(&cfg);
}

/*******************************************************************
** 函数名称:   ST_UART_OpenUart
** 函数描述:   打开串口并初始化
** 参数:       [in]  cfg:串口配置参数 
** 返回:       成功返回true,失败返回false
********************************************************************/
BOOLEAN ST_UART_OpenUart(UART_CFG_T *cfg)
{
    INT8U com;
    const UART_TBL_T *pinfo;
    
    OS_ASSERT((cfg != 0), RETURN_FALSE);
    OS_ASSERT((cfg->com < UART_COM_MAX), RETURN_FALSE);
    OS_ASSERT((cfg->tx_len != 0), RETURN_FALSE);
    OS_ASSERT((cfg->rx_len != 0), RETURN_FALSE);

    
    com = cfg->com;
    pinfo = ST_UART_GetRegTblInfo(com);
    if (pinfo->enable == 0) {
        return false;
    }
    
    if (com == UART_COM_2) {
        s_uart1map = UART_COM_2 - UART_COM_0;
    }
    
    if ((s_uart[com].status & _OPEN) != 0) {                                   /* 串口已打开 */
        s_uart[com].status &= ~(_OPEN | _SENDING);
        USART_Cmd((USART_TypeDef *)pinfo->uart_base, DISABLE);
        USART_DeInit((USART_TypeDef *)pinfo->uart_base);
        
        if (pinfo->dma_base_tx != 0) {
            DMA_DeInit((DMA_Channel_TypeDef *)pinfo->dma_base_tx);
        }
        
        if (pinfo->dma_base_rx != 0) {
            DMA_DeInit((DMA_Channel_TypeDef *)pinfo->dma_base_rx);
        }
    }
    
    if (s_uart[com].p_rx == 0 || s_uart[com].rx_len != cfg->rx_len) {
        if (s_uart[com].p_rx != 0) {
            YX_DYM_Free(s_uart[com].p_rx);
        }
        s_uart[com].p_rx = YX_DYM_Alloc(cfg->rx_len);
        if (s_uart[com].p_rx == 0) {
            #if DEBUG_ERR > 0
            printf_com("<p_rx malloc memory fail>\r\n");
            #endif
            return false;
        }
        
        s_uart[com].rx_len = cfg->rx_len;
        YX_InitLoopBuffer(&s_uart[com].r_round, s_uart[com].p_rx, s_uart[com].rx_len);
    }
    
    if (s_uart[com].p_tx == 0 || s_uart[com].tx_len != cfg->tx_len) {
        if (s_uart[com].p_tx != 0) {
            YX_DYM_Free(s_uart[com].p_tx);
        }
        s_uart[com].p_tx = YX_DYM_Alloc(cfg->tx_len);
        if (s_uart[com].p_tx == 0) {
            #if DEBUG_ERR > 0
            printf_com("<p_tx malloc memory fail>\r\n");
            #endif
            return false;
        }
        
        s_uart[com].tx_len = cfg->tx_len;
        YX_InitLoopBuffer(&s_uart[com].s_round, s_uart[com].p_tx, s_uart[com].tx_len);
    }
    
    STM32_UART_PinsConfig(pinfo, TRUE);                                        /* configure the rx & tx pins */
    STM32_UART_DMAConfig(pinfo);                                               /* config uart1-4 tx DMA mode */
    STM32_UART_Init(cfg);                                                      /* 通信参数配置 */

    YX_MEMCPY(&s_uart[com].uartcfg, sizeof(s_uart[com].uartcfg), cfg, sizeof(UART_CFG_T));
    s_uart[com].status = _OPEN;
    return true;
}

/*******************************************************************
** 函数名:     ST_UART_CloseUart
** 函数描述:   关闭串口
** 参数:       [in] com: 通道编号,见UART_COM_E
** 返回:       成功返回true, 失败返回false
********************************************************************/
BOOLEAN ST_UART_CloseUart(INT8U com)
{
    const UART_TBL_T *pinfo;
    
    if (com >= UART_COM_MAX) {
        return false;
    }
    
    pinfo = ST_UART_GetRegTblInfo(com);
    if (pinfo->enable == 0) {
        return false;
    }
    
    if (com == UART_COM_2) {
        s_uart1map = 0;
    }
    
    if ((s_uart[com].status & _OPEN) != 0) {                                   /* 串口已打开 */
        s_uart[com].status &= ~(_OPEN | _SENDING);
        STM32_UART_PinsConfig(pinfo, FALSE);
        USART_Cmd((USART_TypeDef *)pinfo->uart_base, DISABLE);
        USART_DeInit((USART_TypeDef *)pinfo->uart_base);
        
        if (pinfo->dma_base_tx != 0) {
            DMA_DeInit((DMA_Channel_TypeDef *)pinfo->dma_base_tx);
        }
        
        if (pinfo->dma_base_rx != 0) {
            DMA_DeInit((DMA_Channel_TypeDef *)pinfo->dma_base_rx);
        }
    }
    s_uart[com].status &= ~(_OPEN | _SENDING);
    
    if (s_uart[com].p_rx != 0) {
        YX_DYM_Free(s_uart[com].p_rx);
        s_uart[com].p_rx = 0;
        s_uart[com].rx_len = 0;
    }
    
    if (s_uart[com].p_tx != 0) {
        YX_DYM_Free(s_uart[com].p_tx);
        s_uart[com].p_tx = 0;
        s_uart[com].tx_len = 0;
    }
    
    return true;
}

/*******************************************************************
** 函数名称: ST_UART_ReadChar
** 函数描述: 获取一个字节数据
** 参数:     [in] com: 通道编号,见UART_COM_E
** 返回:     成功返回串口数据，失败返回-1
********************************************************************/
INT32S ST_UART_ReadChar(INT8U com)
{
    if (com >= UART_COM_MAX) {
        return -1;
    }
    
    if ((s_uart[com].status & _OPEN) == 0) {
        return -1;
    }
    
    return YX_ReadLoopBuffer(&s_uart[com].r_round);
}

/*******************************************************************
** 函数名称: ST_UART_WriteChar
** 函数描述: 发送一个字节
** 参数:     [in] com: 通道编号,见UART_COM_E
**           [in] data:字节数据
** 返回:     成功返回true,失败返回false
********************************************************************/
BOOLEAN ST_UART_WriteChar(INT8U com, INT8U data)
{
    INT8U result;
    INT16U i, bufsize;
    INT32U cpu_sr;

    if (com >= UART_COM_MAX) {
        return FALSE;
    }
    
    if ((s_uart[com].status & _OPEN) == 0) {
        return FALSE;
    }
    
    result = YX_WriteLoopBuffer(&s_uart[com].s_round, data);
    
    OS_ENTER_CRITICAL();
    if ((s_uart[com].status & _SENDING) == 0) {
        OS_EXIT_CRITICAL();
        
        bufsize = YX_UsedOfLoopBuffer(&s_uart[com].s_round);
        if (bufsize > 0) {
            if (bufsize > DMA_TX_LEN) {
                bufsize = DMA_TX_LEN;
            }
    
            for (i = 0; i < bufsize; i++) {
                s_uart[com].p_dma_tx[i] = YX_ReadLoopBuffer(&s_uart[com].s_round);
            }
            
            s_uart[com].status |= _SENDING;
            STM32_UART_TxDMAStart(com, s_uart[com].p_dma_tx, bufsize);
        }
    } else {
        OS_EXIT_CRITICAL();
    }
    
    return result;
}

/*******************************************************************
** 函数名称: ST_UART_WriteCharWait
** 函数描述: 发送一个字节,等待发送完毕
** 参数:     [in] com: 通道编号,见UART_COM_E
**           [in] data:字节数据
** 返回:     成功返回true,失败返回false
********************************************************************/
BOOLEAN ST_UART_WriteCharWait(INT8U com, INT8U data)
{
    const UART_TBL_T *pinfo;
    
    if (com >= UART_COM_MAX) {
        return false;
    }
    
