starjunes/GD32/source/hal/driver/c/st_uart_drv.c
    pinfo = ST_UART_GetRegTblInfo(com);
    if (pinfo->enable == 0) {
        return false;
    }

    USART_SendData((USART_TypeDef *)pinfo->uart_base, data);
    while(USART_GetFlagStatus((USART_TypeDef *)pinfo->uart_base, USART_FLAG_TXE) == RESET)
    {
    }
    #if 0
    //while ((((USART_TypeDef *)pinfo->uart_base)->ISR & 0x80) == 0) {};
    ((USART_TypeDef *)pinfo->uart_base)->DR = (data & 0x01FF);
    while ((((USART_TypeDef *)pinfo->uart_base)->SR & 0x40) == 0) {};
    #endif
    return true;
}

/*******************************************************************
** 函数名称: ST_UART_WriteBlock
** 函数描述: 发送一串数据
** 参数:     [in] com: 通道编号,见UART_COM_E
**           [in] sptr:数据指针
**           [in] slen:数据长度
** 返回:     成功返回true,失败返回false
********************************************************************/
BOOLEAN ST_UART_WriteBlock(INT8U com, INT8U *sptr, INT16U slen)
{
    INT8U result;
    INT16U i, bufsize;
    INT32U cpu_sr;
	  
    if ((sptr == 0) || (slen == 0)) {
        return FALSE;
    }
    
    if (com >= UART_COM_MAX) {
        return FALSE;
    }
    
    if ((s_uart[com].status & _OPEN) == 0) {
        return FALSE;
    }
    
    result = YX_WriteBlockLoopBuffer(&s_uart[com].s_round, sptr, slen);
        
    OS_ENTER_CRITICAL();
    if ((s_uart[com].status & _SENDING) == 0) {
        OS_EXIT_CRITICAL();
        
        bufsize = YX_UsedOfLoopBuffer(&s_uart[com].s_round);
        if (bufsize > 0) {
            if (bufsize > DMA_TX_LEN) {
                bufsize = DMA_TX_LEN;
            }
    
            for (i = 0; i < bufsize; i++) {
                s_uart[com].p_dma_tx[i] = YX_ReadLoopBuffer(&s_uart[com].s_round);
            }

    		s_uart[com].status |= _SENDING;
            STM32_UART_TxDMAStart(com, s_uart[com].p_dma_tx, bufsize);
        }
    } else {
        OS_EXIT_CRITICAL();
    }
    
    return result;
}

/*******************************************************************
** 函数名称: ST_UART_GetRecvBytes
** 函数描述: 获取已接收字节数
** 参数:     [in] com: 通道编号,见UART_COM_E
** 返回:     已接收字节数
********************************************************************/
INT32U ST_UART_GetRecvBytes(INT8U com)
{
    if (com >= UART_COM_MAX) {
        return 0;
    }
    
    if ((s_uart[com].status & _OPEN) == 0) {
        return 0;
    }
    
    return YX_UsedOfLoopBuffer(&s_uart[com].r_round);
}

/*******************************************************************
** 函数名称: ST_UART_LeftOfSendbuf
** 函数描述: 获取发送缓存剩余空间
** 参数:     [in] com: 通道编号,见UART_COM_E
** 返回:     剩余空间字节数
********************************************************************/
INT32U ST_UART_LeftOfSendbuf(INT8U com)
{
    if (com >= UART_COM_MAX) {
        return 0;
    }
    
    if ((s_uart[com].status & _OPEN) == 0) {
        return 0;
    }
    
    return YX_LeftOfLoopBuffer(&s_uart[com].s_round);
}

/*******************************************************************
** 函数名称: ST_UART_Pause
** 函数描述: 串口暂停工作,用于省电
** 参数:     [in] com: 通道编号,见UART_COM_E
**           [in] tx:  配置发送管脚电平
**           [in] rx:  配置接收管脚电平
** 返回:     剩余空间字节数
********************************************************************/
BOOLEAN ST_UART_Pause(INT8U com, INT8U tx, INT8U rx)
{
    OS_ASSERT((com < UART_COM_MAX), RETURN_FALSE);
    
    if((s_uart[com].status & _OPEN) == 0) {
        return TRUE;
    }

    if(ST_UART_CloseUart(com))  {
        s_uart[com].pause = TRUE;
        return TRUE;
    }

    return FALSE;
}

/*******************************************************************
** 函数名称: ST_UART_Restart
** 函数描述: 按上次暂停配置重新开始
** 参数:     [in] com: 通道编号,见UART_COM_E
** 返回:     剩余空间字节数
********************************************************************/
BOOLEAN ST_UART_Restart(INT8U com)
{
    OS_ASSERT((com < UART_COM_MAX), RETURN_FALSE);

    if((s_uart[com].status & _OPEN) != 0) {
        return TRUE;
    }
    
    if(!s_uart[com].pause) {
        return FALSE;
    }

    s_uart[com].pause = FALSE;

    ST_UART_OpenUart(&s_uart[com].uartcfg);

    return TRUE;
}

/*******************************************************************
** 函数名称: ST_UART_GetLastCfg
** 函数描述: 获取上次配置参数
** 参数:     [in] com: 通道编号,见UART_COM_E
** 返回:     UART_CFG_T
********************************************************************/
UART_CFG_T * ST_UART_GetLastCfg(INT8U com)
{
    OS_ASSERT((com < UART_COM_MAX), RETURN_FALSE);

    if(s_uart[com].uartcfg.tx_len == 0 || s_uart[com].uartcfg.rx_len == 0 ) {
        return 0;
    }

    return &s_uart[com].uartcfg;
}

/*******************************************************************
** 函数名称: ST_UART_RegeditReceive
** 函数描述: 注册串口数据接收
** 参数:     [in] com: 通道编号,见UART_COM_E
**           [in] fp:  处理回调
** 返回:     结果
注意:        注册的处理器由中断函数直接调用,不可处理耗时长的函数
********************************************************************/
BOOLEAN ST_UART_RegeditReceive(INT8U com, BOOLEAN (*fp)(INT8U com, INT8U *ptr, INT16U length))
{
   s_uart[com].receive_callback = fp;

    return TRUE;
}

/*******************************************************************
** 函数名称: UARTx_TxDMAIrqService
** 函数描述: DMA发送中断处理
** 参数:     [in] com: 通道编号,见UART_COM_E
** 返回:     无
********************************************************************/
__attribute__ ((section ("IRQ_HANDLE"))) void UARTx_TxDMAIrqService(INT8U com)
{
    INT16U i, bufsize;
	const UART_TBL_T *pinfo;
	
	if (com >= UART_COM_MAX) {
	    return;
	}
	
	com = (com == 0) ? (com + s_uart1map) : com;
	    
    pinfo = ST_UART_GetRegTblInfo(com);
    if (((s_uart[com].status & _OPEN) == 0) || ((s_uart[com].status & _SENDING) == 0)) {
        DMA_Cmd((DMA_Channel_TypeDef *)pinfo->dma_base_tx, DISABLE);
        DMA_ITConfig((DMA_Channel_TypeDef *)pinfo->dma_base_tx, DMA_IT_TC, DISABLE);
        return;
    }
    
    bufsize = YX_UsedOfLoopBuffer(&s_uart[com].s_round);
    if (bufsize == 0) {
        s_uart[com].status &= (~_SENDING);
        DMA_ITConfig((DMA_Channel_TypeDef *)pinfo->dma_base_tx, DMA_IT_TC, DISABLE);
        DMA_Cmd((DMA_Channel_TypeDef *)pinfo->dma_base_tx, DISABLE);
        return;
    }
    
    if (bufsize > DMA_TX_LEN) {
        bufsize = DMA_TX_LEN;
    }
    
    for (i = 0; i < bufsize; i++) {
        s_uart[com].p_dma_tx[i] = YX_ReadLoopBuffer_INT(&s_uart[com].s_round);
    }
    
    STM32_UART_TxDMAStart(com, s_uart[com].p_dma_tx, bufsize);
}

/*******************************************************************
** 函数名称: UARTx_RxDMAIrqService
** 函数描述: DMA接收中断处理
** 参数:     [in] com: 通道编号,见UART_COM_E
** 返回:     无
********************************************************************/
__attribute__ ((section ("IRQ_HANDLE"))) void UARTx_RxDMAIrqService(INT8U com)
{
    INT16U bufsize;
	const UART_TBL_T *pinfo;
	DMA_Channel_TypeDef *dma_register_base;
	
	if (com >= UART_COM_MAX) {
	    return;
	}
    
    com = (com == 0) ? (com + s_uart1map) : com;
	    
