starjunes/GD32/source/hal/driver/c/st_uart_drv.c
    pinfo = ST_UART_GetRegTblInfo(com);
	dma_register_base = (DMA_Channel_TypeDef *)pinfo->dma_base_rx;
    if ((s_uart[com].status & _OPEN) == 0) {
        DMA_Cmd(dma_register_base, DISABLE);
        return;
    }
    
    bufsize = DMA_RX_LEN - DMA_GetCurrDataCounter(dma_register_base);
    
    DMA_Cmd(dma_register_base, DISABLE);  //停止使能 才能修改计数器
    if (s_uart[com].sel == 0) {
        dma_register_base->CMAR  = (INT32U)s_uart[pinfo->com].p_dma_rx1;
        dma_register_base->CNDTR = DMA_RX_LEN;
    } else {
        dma_register_base->CMAR  = (INT32U)s_uart[pinfo->com].p_dma_rx0;
        dma_register_base->CNDTR = DMA_RX_LEN;
    }
    DMA_Cmd(dma_register_base, ENABLE);
    
    if (s_uart[com].sel == 0) {
        s_uart[com].sel = 1;
        YX_WriteBlockLoopBuffer_INT(&s_uart[com].r_round, s_uart[pinfo->com].p_dma_rx0, bufsize);
    } else {
        s_uart[com].sel = 0;
        YX_WriteBlockLoopBuffer_INT(&s_uart[com].r_round, s_uart[pinfo->com].p_dma_rx1, bufsize);
    }
}

/*******************************************************************
** 函数名称: Uartx_TxIrqService
** 函数描述: UART发送中断处理
** 参数:     [in] com:                 通道编号,见UART_COM_E
**           [in] uart_base:  uart寄存器基址
** 返回:     无
********************************************************************/
__attribute__ ((section ("IRQ_HANDLE"))) void Uartx_TxIrqService(INT8U com, INT32U uart_base)
{
    INT32S ch;
    
    if (com >= UART_COM_MAX) {
	    return;
	}
    
    com = (com == 0) ? (com + s_uart1map) : com;
	
	if ((s_uart[com].status & _OPEN) != 0) {
	    ch = YX_ReadLoopBuffer_INT(&s_uart[com].s_round);
	    if (ch != -1) {
	        ((USART_TypeDef *)uart_base)->DR = (ch & 0x01FF);
	    }
	} else {
	    USART_ITConfig((USART_TypeDef *)uart_base, USART_IT_TXE, DISABLE);
	}
}

/*******************************************************************
** 函数名称: Uartx_RxIrqService
** 函数描述: UART接收中断处理
** 参数:     [in] com:                 通道编号,见UART_COM_E
**           [in] uart_base:  uart寄存器基址
**           [in] data:                字节数据
** 返回:     无
********************************************************************/
__attribute__ ((section ("IRQ_HANDLE"))) void Uartx_RxIrqService(INT8U com, INT32U uart_base, INT16U data)
{
    if (com >= UART_COM_MAX) {
	    return;
	}
	
	com = (com == 0) ? (com + s_uart1map) : com;
	
	if ((s_uart[com].status & _OPEN) != 0) {
	    YX_WriteLoopBuffer_INT(&s_uart[com].r_round, data);

        /* 分发给其他处理器 */
        if(s_uart[com].receive_callback != 0) {
            s_uart[com].receive_callback(com, (INT8U *)&data, 1);
        }
        
	} else {
	    USART_ITConfig((USART_TypeDef *)uart_base, USART_IT_RXNE, DISABLE);
	}
}




